import io.cucumber.java.ru.Дано;
import io.cucumber.java.ru.Когда;
import io.cucumber.java.ru.Тогда;

public class RegistrationSteps {
    @Дано("Открыт браузер {string}")
    public void открытБраузерGoogleChrome() {

    }

    @Дано("Открыта веб-страница по адресу: {string}")
    public void открытаВебСтраницаПоАдресуHttpsMisagoRndLanitRu(int arg0) {
    }

    @Когда("Пользователь жмет на кнопку {string}")
    public void пользовательЖметНаКнопкуРегистрация() {
    }

    @Тогда("Открывается окно {string}")
    public void открываетсяОкноРегистрация() {
    }

    @Когда("Пользователь вводит в поле {string} значение {string}")
    public void пользовательВводитВПолеИмяПользователяЗначениеTest_g(int arg0, int arg1) {
    }

    @Когда("Пользователь кликает на кнопку {string}")
    public void пользовательКликаетНаКнопкуЗарегистрироватьАккаунт() {
    }

    @Тогда("Окно {string}")
    public void окноРегистрацияЗакрывается() {
    }

    @Тогда("Появлятся бар: вы вошли как {string}")
    public void появлятсяБарВыВошлиКакTest_g(int arg0, int arg1) {
    }

    @Тогда("Под полем {string} полявляется сообщение: {string}")
    public void подПолемИмяПользователяПолявляетсяСообщениеДанноеИмяПользователяНедоступно() {
    }

    @Когда("Пользователь вводит в поле {string} значение любую строку длинной меньше чем {int}.")
    public void пользовательВводитВПолеПарольЗначениеЛюбуюСтрокуДлиннойМеньшеЧем(int arg0) {
    }
}
